In [15]:
from skimage import data,io
from skimage.feature import  hog
import matplotlib.pyplot as plt
img = data.camera()
log_feat,hog_img = hog(img,visualise=True)
print(log_feat.shape)
# plt.imshow(hog_img)

C:\Users\admin\Anaconda3\envs\tensorflow\lib\site-packages\skimage\feature\_hog.py:150: skimage_deprecation: Default value of `block_norm`==`L1` is deprecated and will be changed to `L2-Hys` in v0.15. To supress this message specify explicitly the normalization method.
  skimage_deprecation)
C:\Users\admin\Anaconda3\envs\tensorflow\lib\site-packages\skimage\feature\_hog.py:248: skimage_deprecation: Argument `visualise` is deprecated and will be changed to `visualize` in v0.16
  'be changed to `visualize` in v0.16', skimage_deprecation)

(311364,)

In [16]:
import numpy as np
import pandas as pd

raw_data ={"name":['Bulbasaur','Charmander','Squirtle','Caterpie'],
           "evolution":['Ivysaur','Charmeleon','Wartortle','Metapod'],
           "type":['grass','fire','water','bug'],
           "hp":[45,39,44,45],
           "pokedex":['yes','no','yes','no']   
            }
pokeman = pd.DataFrame(raw_data)
pokeman.head()

         name   evolution   type  hp pokedex
0   Bulbasaur     Ivysaur  grass  45     yes
1  Charmander  Charmeleon   fire  39      no
2    Squirtle   Wartortle  water  44     yes
3    Caterpie     Metapod    bug  45      no

In [17]:
pokeman = pokeman[['name','type','hp','evolution','pokedex']]
pokeman

         name   type  hp   evolution pokedex
0   Bulbasaur  grass  45     Ivysaur     yes
1  Charmander   fire  39  Charmeleon      no
2    Squirtle  water  44   Wartortle     yes
3    Caterpie    bug  45     Metapod      no

In [18]:
pokeman['place']=['park','street','lake','forest']
pokeman

         name   type  hp   evolution pokedex   place
0   Bulbasaur  grass  45     Ivysaur     yes    park
1  Charmander   fire  39  Charmeleon      no  street
2    Squirtle  water  44   Wartortle     yes    lake
3    Caterpie    bug  45     Metapod      no  forest

In [19]:
pokeman.dtypes

name         object
type         object
hp            int64
evolution    object
pokedex      object
place        object
dtype: object

AttributeError: module 'skimage.data' has no attribute 'AA'

In [22]:
apple_stock ={"Date":['2014-07-08','2014-07-07','2014-07-03','2014-07-02','2014-07-01'],
               "Open":['96.27','94.14','93.67','93.87','93.52'],
               "High":['96.80','95.99','94.10','94.06','94.07'],
               "Low":['93.92','94.10','93.20','93.09','93.13'],
               "Close":['95.35','95.97','94.03','93.48','93.52'],
               "Volume":['65130000','56305400','22891800','28420900','38170200'],
               "Adj Close":['95.35','95.97','94.03','93.48','93.52']
            }
apple_stock=pd.DataFrame(apple_stock)
apple_stock.head()

         Date   Open   High    Low  Close    Volume Adj Close
0  2014-07-08  96.27  96.80  93.92  95.35  65130000     95.35
1  2014-07-07  94.14  95.99  94.10  95.97  56305400     95.97
2  2014-07-03  93.67  94.10  93.20  94.03  22891800     94.03
3  2014-07-02  93.87  94.06  93.09  93.48  28420900     93.48
4  2014-07-01  93.52  94.07  93.13  93.52  38170200     93.52

In [25]:
import matplotlib.pyplot as plt
apple_stock.Date = pd.to_datetime(apple_stock.Date)
apple_stock['Date'].head()

0   2014-07-08
1   2014-07-07
2   2014-07-03
3   2014-07-02
4   2014-07-01
Name: Date, dtype: datetime64[ns]

In [26]:
apple_stock = apple_stock.set_index('Date')
apple_stock.head()

             Open   High    Low  Close    Volume Adj Close
Date
2014-07-08  96.27  96.80  93.92  95.35  65130000     95.35
2014-07-07  94.14  95.99  94.10  95.97  56305400     95.97
2014-07-03  93.67  94.10  93.20  94.03  22891800     94.03
2014-07-02  93.87  94.06  93.09  93.48  28420900     93.48
2014-07-01  93.52  94.07  93.13  93.52  38170200     93.52

In [27]:
apple_stock.index.is_unique

True

In [28]:
apple_stock.sort_index(ascending=True).head()

             Open   High    Low  Close    Volume Adj Close
Date
2014-07-01  93.52  94.07  93.13  93.52  38170200     93.52
2014-07-02  93.87  94.06  93.09  93.48  28420900     93.48
2014-07-03  93.67  94.10  93.20  94.03  22891800     94.03
2014-07-07  94.14  95.99  94.10  95.97  56305400     95.97
2014-07-08  96.27  96.80  93.92  95.35  65130000     95.35

In [32]:
apple_stock.to_csv('Apple_stock.csv')

In [33]:
irisData = pd.read_csv('iris.data.csv')
irisData.head()

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa

In [35]:
irisData.columns =['sepal_length','sepal_width','petal_length','petal_width','class']
irisData.head()

   sepal_length  sepal_width  petal_length  petal_width        class
0           4.9          3.0           1.4          0.2  Iris-setosa
1           4.7          3.2           1.3          0.2  Iris-setosa
2           4.6          3.1           1.5          0.2  Iris-setosa
3           5.0          3.6           1.4          0.2  Iris-setosa
4           5.4          3.9           1.7          0.4  Iris-setosa

In [36]:
pd.isnull(irisData).sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
class           0
dtype: int64